In [1]:
import pandas as pd

In [2]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [3]:
obj3['California']

True

In [4]:
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [5]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [6]:
df_lis = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]], index=[4, 5, 6], columns=['a', 'b', 'c'])
df_lis

    a   b   c
4   0   2   3
5   0   4   1
6  10  20  30

In [7]:
df_lis.rename(mapper = lambda x: x.upper(), axis=1, inplace=True)

In [8]:
df_lis

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [9]:
df_lis = df_lis.rename(mapper = lambda x: x.upper(), axis = 1)

In [10]:
df_lis

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [11]:
df_lis = df_lis.rename(mapper = lambda x: x.upper(), axis = 'columns')

In [12]:
df_lis

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [13]:
df_lis.rename(mapper = lambda x: x.upper(), axis=1)

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [27]:
df_lis

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [26]:
df_lis.iloc[:, :-1].values

array([[ 0,  2],
       [ 0,  4],
       [10, 20]])

In [16]:
df_lis.where(df_lis['C']>1)

      A     B     C
4   0.0   2.0   3.0
5   NaN   NaN   NaN
6  10.0  20.0  30.0

In [18]:
df_lis.drop('A', axis=1)

    B   C
4   2   3
5   4   1
6  20  30

In [19]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [20]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [21]:
df = pd.DataFrame({'Serial No.': [1,2,3,4,5], 'gre score': [337,324,316,322,314], 'toefl score': [118,107,104,110,103]})
df = df.set_index('Serial No.')
df

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [30]:
df.iloc[: , :-1].values

array([[337],
       [324],
       [316],
       [322],
       [314]])

In [22]:
(df['toefl score']>105) & (df['toefl score']<115)

Serial No.
1    False
2     True
3    False
4     True
5    False
Name: toefl score, dtype: bool

In [23]:
df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]

            gre score  toefl score
Serial No.
2                 324          107
4                 322          110

In [24]:
df[(df['toefl score']>105) & (df['toefl score']<115)]

            gre score  toefl score
Serial No.
2                 324          107
4                 322          110

In [25]:
df[(df['toefl score'].isin(range(105, 115)))]

            gre score  toefl score
Serial No.
2                 324          107
4                 322          110